#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_cluster.data.aws_partition.current: Reading...
module.nat.aws_iam_role.this: Refreshing state... [id=main20231020133239490200000001]
module.ecs_service.module.container_definition["django-app"].data.aws_region.current: Reading...
module.ecs_service.data.aws_partition.current: Reading...
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/django-prod]
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
data.aws_availability_zones.aws_azs: Reading...
aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.ecs_service.module.container_definition["django-app"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/django-personal-site/django-app]
module.ecs_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.nat.data.aws_ami.this: Reading...
module.ecs_service.module.container_definition["django-app"].data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
module.ecs_service.data.aws_region.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e1d0243d02de04e0]
aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.ecs_service.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ecs_service.aws_iam_policy.task_exec[0]: Refreshing state... [id=arn:aws:iam::954050840447:policy/django-personal-site-20231020130010305600000003]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=954050840447]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs_service.aws_iam_role.task_exec[0]: Refreshing state... [id=django-personal-site-20231020130010303600000001]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3252303218]
module.ecs_service.aws_iam_role.tasks[0]: Refreshing state... [id=django-personal-site-20231020130010304400000002]
module.nat.aws_iam_role_policy_attachment.ssm: Refreshing state... [id=main20231020133239490200000001-20231020133240375600000005]
module.nat.aws_iam_instance_profile.this: Refreshing state... [id=main20231020133240126100000004]
module.nat.aws_iam_role_policy.eni: Refreshing state... [id=main20231020133239490200000001:main20231020133240123400000003]
aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
module.ecs_service.aws_iam_role_policy_attachment.task_exec[0]: Refreshing state... [id=django-personal-site-20231020130010303600000001-20231020130010604800000005]
aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
data.aws_availability_zones.aws_azs: Read complete after 1s [id=eu-west-1]
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:954050840447:cluster/django-prod]
module.ecs_service.aws_ecs_task_definition.this[0]: Refreshing state... [id=django-personal-site]
module.nat.data.aws_ami.this: Read complete after 1s [id=ami-009452531fa1056fa]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=django-prod]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e39f2ae61401b1c4]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08a301e7900ff17ef]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-09db5785a6dfd071c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-077f4e93189de9d4e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e8fc1e1647b7df17]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-083ae407345a775e5]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-target-group/39a7f31d27e6e698]
module.nat.aws_security_group.this: Refreshing state... [id=sg-0c6313471bcdecea2]
module.alb_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-032cfc42b7478e925]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06f8c93e4a685e1ab]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a2558af275291418]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f096da4f7714fcf7]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e5885469478459b1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ac9304bc66da227f]
module.nat.aws_network_interface.this: Refreshing state... [id=eni-074aa0b51c9b34511]
module.nat.aws_security_group_rule.egress: Refreshing state... [id=sgrule-579023165]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a92982e3e98f3ad6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08068361a78700ab1]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-86115656]
module.alb_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-441417626]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3522305327]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-1143663398]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[3]: Refreshing state... [id=sgrule-2473780471]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3552822451]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06f8c93e4a685e1ab1080289494]
module.nat.aws_launch_template.this: Refreshing state... [id=lt-0c100ce01d2e6663d]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:loadbalancer/app/django-elb/3d0916a3c7717f9e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2708099d9838709]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03ce0c4a44c839a6d]
aws_eip.nat: Refreshing state... [id=eipalloc-08b1f157f51478859]
module.ecs_service.data.aws_subnet.this[0]: Reading...
module.nat.aws_security_group_rule.ingress_any: Refreshing state... [id=sgrule-4053442999]
module.nat.aws_route.this[0]: Refreshing state... [id=r-rtb-0f096da4f7714fcf71080289494]
module.nat.aws_route.this[1]: Refreshing state... [id=r-rtb-0e5885469478459b11080289494]
module.ecs_service.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-0a2558af275291418]
module.ecs_service.aws_security_group.this[0]: Refreshing state... [id=sg-06555b36d0678f385]
module.nat.aws_autoscaling_group.this: Refreshing state... [id=main20231020133244115100000009]
module.ecs_service.aws_security_group_rule.this["alb_ingress_3000"]: Refreshing state... [id=sgrule-851394091]
module.ecs_service.aws_security_group_rule.this["egress_all"]: Refreshing state... [id=sgrule-2387903463]
module.ecs_service.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:954050840447:service/django-prod/django-personal-site]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:listener/app/django-elb/3d0916a3c7717f9e/3713d42335b643a3]
module.ecs_service.aws_appautoscaling_target.this[0]: Refreshing state... [id=service/django-prod/django-personal-site]
module.ecs_service.aws_appautoscaling_policy.this["cpu"]: Refreshing state... [id=cpu]
module.ecs_service.aws_appautoscaling_policy.this["memory"]: Refreshing state... [id=memory]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "django-personal-site"
      + task_role_arn        = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:954050840447:service/django-prod/django-personal-site"
        name                               = "django-personal-site"
        tags                               = {
            "ManagedBy" = "Terraform"
        }
      ~ task_definition                    = "django-personal-site:1" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:954050840447:task-definition/django-personal-site:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:954050840447:task-definition/django-personal-site" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "django-app"
                  + repositoryCredentials  = {
                      + credentialsParameter = "arn:aws:secretsmanager:eu-west-1:748908074032:secret:philward_io/docker_hub_access-3hCHBr"
                    }
                    # (17 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "django-personal-site" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "ManagedBy" = "Terraform"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @phil-ward, Action: `pull_request`, Working Directory: ``, Workflow: `ci`*